# --- !Ups

insert into issue (title, description, lat, lon, status, created) values
('Светофор', 'Неделю не работает светофор', 55.437724, 65.328618, 3, '2019-09-06 08:00:00'),
('Разрыли яму', 'Перекрыта дорога, ремонтируют дорогу', 55.438868, 65.331064, 4, '2019-09-09 12:00:00'),
('Порыв трубы', 'Сильный фонтан горячей воды', 55.460166, 65.372485, 1, '2019-09-10 09:00:00'),
('Ремонт дороги', 'Ремонтируют канализацию', 55.442269, 65.365050, 4, '2019-09-09 16:00:00'),
('Ремонт дороги', 'Ремонтируют дорогу', 55.462502, 65.366854, 5, '2019-09-08 20:00:00'),
('Нет люка канализации', 'Украли люк канализации на проезжей части', 55.418283, 65.245371, 3, '2019-09-14 23:00:00'),
('Перевернута остановка', 'Ветром перевернуло остановку', 55.418456, 65.375036, 2, '2019-09-26 22:00:00'),
('Мешки с мусором', 'Кто то выкинул мусор на обочину', 55.458890, 65.410063, 1, '2019-09-25 23:00:00'),
('Светофор', 'Неделю не работает светофор', 55.459157, 65.335093, 3, '2019-09-10 11:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.443572, 65.329020, 3, '2019-09-24 06:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.438962, 65.348326, 3, '2019-09-01 08:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.435401, 65.331489, 3, '2019-09-10 12:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.444559, 65.349108, 3, '2019-09-11 19:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.448282, 65.335560, 3, '2019-09-27 21:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.432897, 65.322688, 3, '2019-09-20 22:00:00'),
('Ремонт дороги', 'Кладут новое полотно', 55.439202, 65.346942, 3, '2019-09-29 14:00:00'),
('Мусор', 'Нелегальная свалка', 55.436798, 65.360701, 3, '2019-09-12 18:00:00'),
('Мусор', 'Нелегальная свалка', 55.439913, 65.370737, 3, '2019-09-16 19:00:00'),
('Мусор', 'Нелегальная свалка', 55.450441, 65.374993, 3, '2019-09-27 17:00:00'),
('Благоустройство', 'Нет пандус для инвалидов', 55.439953, 65.353972, 3, '2019-09-21 19:00:00'),
('Благоустройство', 'Нет пандус для инвалидов', 55.444066, 65.347002, 3, '2019-09-13 12:00:00'),
('Благоустройство', 'Нет пандус для инвалидов', 55.445198, 65.349008, 3, '2019-09-23 16:00:00'),
('Благоустройство', 'Нет пандус для инвалидов', 55.444607, 65.354834, 3, '2019-09-05 18:00:00'),
('Благоустройство', 'Нет пандус для инвалидов', 55.438442, 65.335608, 3, '2019-09-06 06:00:00'),
('Состояние здания', 'Плохое состояние дома', 55.442733, 65.32564, 3, '2019-09-01 09:00:00'),
('Состояние здания', 'Давно не делали косметический ремонт', 55.445137, 65.333709, 3, '2019-09-01 18:00:00'),
('Состояние здания', 'Давно не делали косметический ремонт', 55.431649, 65.343364, 3, '2019-09-27 17:00:00'),
('Состояние здания', 'Протекает крыша', 55.433877, 65.350993, 3, '2019-09-27 06:00:00');

insert into authority (name, phone, email, url, address) values
('ООО "ПСК "КУРГАНСТРОЙСЕТИ"', '8 (352) 264-01-74', 'shesh01062010@rambler.ru', null,'641304, Курганская обл., Кетовский р-н, с.Колташево, ул.Гагарина, д.16'  ),
('Государственное бюджетное учреждение "Кургангазсеть"', '8 (3522) 46-09-80', 'gaznetkurgan@mail.ru', null, '640000, Российская Федерация, Курганская обл., г. Курган, ул. Станционная, 64А'),
('ООО Компания "Промпроект"','8 (352) 260-47-77','alisa450@yandex.ru',null,'640004, г.Курган, ул.Коли Мяготина, д.178, кв.63'),
('ООО "СК"Развитие"','8 (352) 247-42-95','yaa45@mail.ru',null,'640007, г.Курган, ул.Дзержинского, д.29А, КВАРТИРА 83'),
('ООО "Равелин"','8 (499) 391-76-96','ravelin_ooo@mail.ru',null,'г.Москва, ул.Серпуховская Б., д.44, ОФИС 19'),
('Общество с ограниченной ответственностью "РЕМКОМСТРОЙ"',null,'semenof2562@mail.ru',null,'г.Курган, ул.Омская, д.179Л, оф.1'),
('ИП Корытова Наталья Александровна',null,'kordgarant@mail.ru',null,'640001, Российская Федерация, Курганская обл., г. Курган, Коли Мяготина, дом 95, кв.34'),
('ООО "ЮНИТ"',null,null,null,'КУРГАНСКАЯ ОБЛ.,ПРИТОБОЛЬНЫЙ Р-Н,П СОСНОВЫЙ,УЛ СОЛНЕЧНАЯ, Д 1');

insert into issue_category (name, icon, color) values
('Дороги', 'road', 'darkblue'),
('Вобоснабжение', 'tint-slash', 'blue'),
('Мусор', 'trash-alt', 'gray'),
('Состояние здания', 'house-damage', 'red'),
('Благоустройство', 'tree', 'red'),
('Другое', 'exclamation', 'orange');

insert into issue_issue_category (issue_id, issue_category_id) values
(1, 1),
(1, 2),
(2, 1),
(3, 2),
(4, 2),
(5, 3),
(6, 3),
(7, 2),
(8, 3),
(9, 3),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 3),
(18, 3),
(19, 3),
(20, 5),
(21, 5),
(22, 5),
(23, 5),
(24, 5),
(25, 4),
(26, 4),
(27, 4),
(28, 4);


insert into issue_authority (issue_id, authority_id) values
(1, 1),
(1, 2),
(2, 3),
(3, 4),
(4, 5),
(5, 6),
(6, 7),
(7, 8),
(8, 1),
(9, 2),
(10, 3),
(11, 4),
(12, 5),
(13, 6),
(14, 7),
(15, 8),
(16, 1),
(17, 2),
(18, 3),
(19, 4),
(20, 5),
(21, 6),
(22, 7),
(23, 8),
(24, 1),
(25, 2),
(26, 3),
(27, 4),
(28, 5);

# --- !Downs

delete from issue_authority;
delete from issue_issue_category;
delete from issue;
delete from issue_category;
delete from authority;

alter table issue alter column id restart with 1;
alter table issue_category alter column id restart with 1;
alter table authority alter column id restart with 1;
